app/Controllers/Penilaian.php

DELETE FROM `tbl_penilaian`
WHERE `id_alternatif` = '2'
AND `id_sub` NOT IN ('1','3')
---
    public function store()
    {
        $db = db_connect();
        $id_alternatif  = $this->request->getPost("id_alternatif");
        $subArr         = $this->request->getPost("sub_kriteria");
        $now            = date('Y-m-d H:i:s');
        $user           = 'System';
        // $user = $this->session->userdata('username') ? $this->session->userdata('username') : 'System';

        $getPenilaian = $this->m_penilaian->getPenilaianByAlternatif($id_alternatif);

        if (empty($getPenilaian)) {
            $row = [];
            $allRow = [];

            foreach ($subArr as $s) {
                $row['id_alternatif'] = $id_alternatif;
                $row['id_sub'] = $s;
                $row['created_at'] = $now;
                $row['created_by'] = $user;

                $allRow[] = $row;
            }

            $action = $this->m_penilaian->insert_batch('tbl_penilaian', $allRow);
        } else {
            $subExist = array_column($getPenilaian, 'id_sub');

            ### Delete data yang Sub IDnya tidak ada di $subArr
            $db->table('tbl_penilaian')
                ->where('id_alternatif', $id_alternatif)
                ->whereNotIn('id_sub', $subArr)
                ->delete();

UPDATE `tbl_penilaian` SET `id_alternatif` = '2', `id_sub` = '1', `updated_at` = '2024-07-21 17:09:24', `updated_by` = 'System'
WHERE `id_alternatif` = '2'
AND `id_sub` = '1'
---
                        'updated_by'    => $user
                    ];

                    $builder = $db->table('tbl_penilaian')
                        ->where('id_alternatif', $id_alternatif)
                        ->where('id_sub', $id)
                        ->update($data);

INSERT INTO `tbl_penilaian` (`id_alternatif`, `id_sub`, `created_at`, `created_by`) VALUES ('2', '3', '2024-07-21 17:09:24', 'System')
---
                    ];

                    $builder = $db->table('tbl_penilaian');
                    $builder->insert($data);