app/Models/AlternatifModel.php

    public function update_with_param($param)
    {
        $builder = $this->db->table($param['table']);

        $builder->set($param['data']);

        if (isset($param['where'])) {
            $builder->where($param['where']);
        }

        $builder->update();
---
UPDATE `tbl_alternatif` SET `nama_alternatif` = NULL, `updated_at` = '2024-07-20 16:10:16', `updated_by` = 'system'
WHERE `id` = '1'

    public function results($rowperpage, $start, $searchValue)
    {
        $builder = $this->db->table($this->table);

        if (!empty($searchValue)) {
            $searchValue = strtolower($searchValue);
            $builder->like('LOWER(nama_alternatif)', $searchValue);
        }

        $builder->limit($rowperpage, $start);

        return $builder->get()->getResult();
---
SELECT *
FROM `tbl_alternatif`
 LIMIT 10

    public function count_all()
    {
        return $this->db->table($this->table)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_alternatif`

    public function total_record_with_filter($searchValue)
    {
        $builder = $this->db->table($this->table);

        if (!empty($searchValue)) {
            $searchValue = strtolower($searchValue);
            $builder->like('LOWER(nama_alternatif)', $searchValue);
        }

        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_alternatif`