app/Models/KriteriaModel.php

    public function results($rowperpage, $start, $searchValue)
    {
        $builder = $this->db->table($this->table);

        if (!empty($searchValue)) {
            $searchValue = strtolower($searchValue);
            $builder->like('LOWER(kode)', $searchValue);
            $builder->orLike('LOWER(nama)', $searchValue);
        }

        $builder->limit($rowperpage, $start);

        return $builder->get()->getResult();
---
SELECT *
FROM `tbl_kriteria`
 LIMIT 10

    public function count_all()
    {
        return $this->db->table($this->table)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_kriteria`

    public function total_record_with_filter($searchValue)
    {
        $builder = $this->db->table($this->table);

        if (!empty($searchValue)) {
            $searchValue = strtolower($searchValue);
            $builder->like('LOWER(kode)', $searchValue);
            $builder->orLike('LOWER(nama)', $searchValue);
        }

        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_kriteria`