app/Models/PenilaianModel.php

SELECT *
FROM `tbl_alternatif`
 LIMIT 10
SELECT `a`.*, (SELECT id FROM tbl_penilaian WHERE id_alternatif = a.id LIMIT 1) AS cek_id_penilaian
FROM `tbl_alternatif` `a`
 LIMIT 10
---
    public function results($rowperpage, $start, $searchValue)
    {
        $builder = $this->db->table('tbl_alternatif a')
            ->select('a.*, (SELECT id FROM tbl_penilaian WHERE id_alternatif = a.id LIMIT 1) AS cek_id_penilaian');

        if (!empty($searchValue)) {
            $searchValue = strtolower($searchValue);
            $builder->like('LOWER(nama_alternatif)', $searchValue);
        }

        $builder->limit($rowperpage, $start);

        return $builder->get()->getResult();

SELECT COUNT(*) AS `numrows`
FROM `tbl_alternatif`
---
    public function count_all()
    {
        return $this->db->table('tbl_alternatif')
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_alternatif`
---
    public function total_record_with_filter($searchValue)
    {
        $builder = $this->db->table('tbl_alternatif');

        if (!empty($searchValue)) {
            $searchValue = strtolower($searchValue);
            $builder->like('LOWER(nama_alternatif)', $searchValue);
        }

        return $builder->countAllResults();

SELECT `sk`.`id_sub`, `sk`.`nama_sub`, `sk`.`nilai_sub`, `k`.`id` as `id_kriteria`, CONCAT(k.kode, ' (', `k`.`nama`, ')') as kriteria
FROM `tbl_sub_kriteria` `sk`
LEFT JOIN `tbl_kriteria` `k` ON `sk`.`id_kriteria`=`k`.`id`
---
    public function getSubKriteria()
    {
        return $this
            ->db
            ->table('tbl_sub_kriteria sk')
            ->select("sk.id_sub, sk.nama_sub, sk.nilai_sub, k.id as id_kriteria, CONCAT(k.kode, ' (', k.nama, ')') as kriteria")
            ->join('tbl_kriteria k', 'sk.id_kriteria=k.id', 'left')
            ->get()
            ->getResult();

SELECT *
FROM `tbl_penilaian`
WHERE `id_alternatif` = '2'
---
    public function getPenilaianByAlternatif($id_alternatif)
    {
        return $this
            ->db
            ->table($this->table)
            ->select("*")
            ->where('id_alternatif', $id_alternatif)
            ->get()
            ->getResult();