app/Models/SubKriteriaModel.php

SELECT `sk`.`id_sub`, `sk`.`nama_sub`, `sk`.`nilai_sub`, `k`.`id` as `id_kriteria`, CONCAT(k.kode, ' (', `k`.`nama`, ')') as kriteria
FROM `tbl_kriteria` `k`
LEFT JOIN `tbl_sub_kriteria` `sk` ON `sk`.`id_kriteria`=`k`.`id`
---
    public function getKriteria()
    {
        return $this
            ->db
            ->table('tbl_kriteria k')
            ->select("sk.id_sub, sk.nama_sub, sk.nilai_sub, k.id as id_kriteria, CONCAT(k.kode, ' (', k.nama, ')') as kriteria")
            ->join($this->table . ' sk', 'sk.id_kriteria=k.id', 'left')
            ->get()
            ->getResult();